# read design
read_verilog contador.v 
hierarchy -check -top contador

# the high-level stuff 
proc; opt; fsm; opt; memory; opt

#mapping to internal cell library 
techmap; opt 

#mapping flip-flops to cmos_cells.lib 
dfflibmap -liberty cmos_cells.lib 

#mapping logic to cmos_cells.lib 
abc -liberty cmos_cells.lib 

# show -lib cmos_cells.v -format ps
#cleanup 
clean 

#write synthesized design 
write_verilog contador_synt.v
